app/Controllers/Drivers.php

    public function index(): string
    {
        $data = array(
            'title' => 'Drivers',
            'drivers' => $this->drivers_model->findAll(),
        );
---
SELECT *
FROM `drivers`

    public function delete($id) {
        $this->drivers_model->delete($id);
---
DELETE FROM `drivers`
WHERE `id` IN ('25')

    function edit($id) {
        helper('form');

        $this->teams_model = model('TeamsModel');
        $data = array(
            'title' => 'Edit driver',
            'edit' => TRUE,
            'driver' => $this->drivers_model->find($id),
            'get_drivers_teams' => $this->teams_model->get_drivers_teams($id),
            'get_not_drivers_teams' => $this->teams_model->get_not_drivers_teams($id),
        );


        if ($this->request->is('post')) {
            $rules = $this->drivers_model->validationRules;
            if ($this->validate($rules)) {
                $update_data = array(
                    'name' => $this->request->getPost('name', FILTER_SANITIZE_FULL_SPECIAL_CHARS),
                    'nationality' => $this->request->getPost('nationality', FILTER_SANITIZE_FULL_SPECIAL_CHARS),
                    'date_of_birth' => $this->request->getPost('date_of_birth', FILTER_SANITIZE_FULL_SPECIAL_CHARS),
                    'team_id' => $this->request->getPost('team_id', FILTER_SANITIZE_FULL_SPECIAL_CHARS),
                );
                $this->drivers_model->update($id, $update_data);
---
SELECT *
FROM `drivers`
WHERE `drivers`.`id` = '25'
UPDATE `drivers` SET `name` = 'test', `nationality` = 'aasda', `date_of_birth` = '2023-12-05', `team_id` = '5'
WHERE `drivers`.`id` IN ('25')