app/Controllers/Races.php

    public function index(): string
    {
        $data = array(
            'title' => 'Races',
            'races' => $this->races_model->findAll(),
        );
---
SELECT *
FROM `races`

    function edit($id) {
        helper('form');

        $this->drivers_model = model('DriversModel');
        $data = array(
            'title' => 'Edit race',
            'edit' => TRUE,
            'race' => $this->races_model->find($id),
---
SELECT *
FROM `races`
WHERE `races`.`id` = '9'