app/Controllers/Teams.php

SELECT *
FROM `teams`
---
    public function index(): string
    {
        $data = array(
            'title' => 'Teams',
            'teams' => $this->teams_model->findAll(),
        );