app/Models/DriversModel.php

    public function get_race_winner($driver_id) {
      $builder = $this->db->table($this->table.' D');
      $builder->select('*, D.id');
      $builder->join('races R', 'D.id=R.winner_id');
      $builder->where('R.winner_id', $driver_id);
      $query = $builder->get();
---
SELECT *, `D`.`id`
FROM `drivers` `D`
JOIN `races` `R` ON `D`.`id`=`R`.`winner_id`
WHERE `R`.`winner_id` = '9'