app/Models/TeamsModel.php

    public function get_drivers_teams($team_id) {
      $builder = $this->db->table($this->table.' T');
      $builder->select('*, T.id');
      $builder->join('drivers D', 'T.id=D.team_id');
      $builder->where('D.team_id', $team_id);
      $query = $builder->get();
---
SELECT *, `T`.`id`
FROM `teams` `T`
JOIN `drivers` `D` ON `T`.`id`=`D`.`team_id`
WHERE `D`.`team_id` = '25'